In [18]:
import pandas as pd

In [35]:
df = pd.read_csv('../data/malc.csv', header=None, names=['a', 'b', 'c', 'd', 'e', 'f'])
df

,a,b,c,d,e,f
0,159357,208/22- 1,(-1.720611,61.2202),2171.0,Shetland
1,159358,208/23- 1,(-1.514861,61.17053),824.0,Shetland
2,159359,208/24- 1A,(-1.350917,61.19103),792.0,Shetland
3,159360,208/26- 1,(-1.8205,61.11806),1764.0,Shetland

In [36]:
df['mytuple'] = (df.c + ',' +df.d)

In [37]:
df.mytuple

0        (-1.720611, 61.2202)
1       (-1.514861, 61.17053)
2       (-1.350917, 61.19103)
3         (-1.8205, 61.11806)
Name: mytuple, dtype: object

In [38]:
df

,a,b,c,d,e,f,mytuple
0,159357,208/22- 1,(-1.720611,61.2202),2171.0,Shetland,"(-1.720611, 61.2202)"
1,159358,208/23- 1,(-1.514861,61.17053),824.0,Shetland,"(-1.514861, 61.17053)"
2,159359,208/24- 1A,(-1.350917,61.19103),792.0,Shetland,"(-1.350917, 61.19103)"
3,159360,208/26- 1,(-1.8205,61.11806),1764.0,Shetland,"(-1.8205, 61.11806)"

In [40]:
type(df.mytuple[0])

str

In [45]:
df.mytuple[0].strip().split(',')

['(-1.720611', ' 61.2202)']

In [48]:
df['new'] = df.mytuple.str.split(',')

In [52]:
df.new[0][0]

'    (-1.720611'

In [54]:
df['x'], df['y'] = df.new[0]
df

,a,b,c,d,e,f,mytuple,new,x,y
0,159357,208/22- 1,(-1.720611,61.2202),2171.0,Shetland,"(-1.720611, 61.2202)","[ (-1.720611, 61.2202)]",(-1.720611,61.2202)
1,159358,208/23- 1,(-1.514861,61.17053),824.0,Shetland,"(-1.514861, 61.17053)","[ (-1.514861, 61.17053)]",(-1.720611,61.2202)
2,159359,208/24- 1A,(-1.350917,61.19103),792.0,Shetland,"(-1.350917, 61.19103)","[ (-1.350917, 61.19103)]",(-1.720611,61.2202)
3,159360,208/26- 1,(-1.8205,61.11806),1764.0,Shetland,"(-1.8205, 61.11806)","[ (-1.8205, 61.11806)]",(-1.720611,61.2202)

In [55]:
df.x

0        (-1.720611
1        (-1.720611
2        (-1.720611
3        (-1.720611
Name: x, dtype: object

In [56]:
df.y

0     61.2202)
1     61.2202)
2     61.2202)
3     61.2202)
Name: y, dtype: object